Tinkerbug-Robotics/TinkerRocket/tinkerrocket-idf/projects/out_computer/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# BLE / NimBLE
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y

# === POWER MANAGEMENT ===
# Compiled in but only activated at runtime during low-power mode
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=3

# BLE controller modem sleep — radio powers down between BLE events
CONFIG_BT_CTRL_MODEM_SLEEP=y
CONFIG_BT_CTRL_MODEM_SLEEP_MODE_1=y

# (#519) Run the BT low-power clock off the board's 32.768 kHz crystal instead of
# the main XTAL. This is NOT just about powering down a crystal — read the
# controller source (components/bt/controller/esp32c3/bt.c, which the S3 shares):
#
#     } else if (s_lp_cntl.lpclk_sel == ESP_BT_SLEEP_CLOCK_MAIN_XTAL) {
#     #if !CONFIG_BT_CTRL_MAIN_XTAL_PU_DURING_LIGHT_SLEEP
#         s_lp_cntl.no_light_sleep = 1;
#     #endif
#
# On MAIN_XTAL without that option — which is what we shipped — the controller sets
# no_light_sleep, so LIGHT SLEEP IS BLOCKED ENTIRELY while BLE is on. PM_ENABLE and
# tickless idle above were enabled but could never actually engage; the CPU just
# idled at the DFS minimum (loop_oc's own comment says exactly this). With a working
# 32 kHz crystal the controller never sets that flag, and light sleep becomes
# possible with BLE active. THAT is the power win.
#
# Safe by construction: the controller verifies the crystal is really oscillating
# (rtc_clk_slow_src_get() != SOC_RTC_SLOW_CLK_SRC_XTAL32K) and falls back to the
# main XTAL with a warning if it is not — so an unpopulated or dead crystal degrades
# to today's behaviour rather than breaking BLE. The boot log says which path was
# taken, so this is self-diagnosing:
#   OK  -> I BT: "Using external 32.768 kHz crystal/oscillator as clock source"
#   BAD -> W BT: "32.768kHz XTAL not detected, fall back to main XTAL ..."
# Likewise the RTC itself: "If the crystal could not start, it will be switched to
# internal RC" (esp_hw_support Kconfig.rtc).
#
# EXT_32K_XTAL depends on the RTC slow clock being the crystal, so RTC_CLK_SRC must
# be set first — no project in this repo had ever set it, so the whole fleet was
# running its RTC on the internal RC and the crystal was unused hardware.
CONFIG_RTC_CLK_SRC_EXT_CRYS=y
CONFIG_BT_CTRL_LPCLK_SEL_EXT_32K_XTAL=y

# (#519) Crystal watchdog. Making the 32.768 kHz crystal the RTC/BLE clock source
# introduces a failure mode we did not have before: if it stops oscillating, the
# BLE sleep-clock reference stops with it. A tuning-fork crystal is precisely the
# part that can quit under launch shock and vibration, and this rides a rocket.
# ESP_XT_WDT detects the oscillation failure in hardware and automatically switches
# to BACKUP32K_CLK (plus an interrupt) rather than leaving the clock dead. Cheap
# insurance; without it there is no recovery path.
CONFIG_ESP_XT_WDT=y
CONFIG_ESP_XT_WDT_BACKUP_CLK_ENABLE=y

# NOTE if the bench boot log says "32.768kHz XTAL not detected": the first knob to
# try is CONFIG_ESP_SYSTEM_RTC_EXT_XTAL_BOOTSTRAP_CYCLES (default 0 on S3), which
# kicks the crystal with a 32 kHz square wave to help it start.

# (#518) CONFIG_BT_NIMBLE_SLEEP_ENABLE=y used to sit here under a "NimBLE host
# sleep support" comment. No such kconfig symbol exists in ESP-IDF — it is not in
# the bt component's Kconfig and not in its sdkconfig.rename map — so kconfgen
# silently ignored it. The real knob is the controller-side BT_CTRL_MODEM_SLEEP
# block above, which is already correct here. Removed rather than replaced: this
# is a no-op for the generated config, verified by diffing sdkconfig.json.

# PHY power down during sleep
CONFIG_ESP_PHY_MAC_BB_PD=y

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# #398: per-task CPU runtime profiling — identify the core-1 hog (above parser
# prio 6) that co-stalls loop_oc during the ~4 s launch-activation window.
# Trace facility + run-time stats (esp_timer µs clock) + per-task core id feed
# the once-per-stats-interval TASKCPU dump in main.cpp. Small per-context-switch
# cost (one esp_timer read); flip config::PROFILE_TASK_CPU false to silence the
# log without rebuilding config. Bench-diagnostic build.
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_RUN_TIME_STATS_USING_ESP_TIMER=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y

# Interrupt WDT
CONFIG_ESP_INT_WDT=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=300

# Core dump to flash — retrieve after crash with:
#   espcoredump.py info_corefile -t raw -c 0x610000 build/out_computer.elf
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
# (6.0 forces ELF format + SHA256 checksum; the legacy explicit ELF/CRC32
#  selectors are gone — CRC32 is unsupported on 6.0.)

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA rollback: new images boot as PENDING_VERIFY and auto-roll back to ota_0
# unless app calls esp_ota_mark_app_valid_cancel_rollback() after first
# successful telemetry round-trip. See docs/plans/08-ota-firmware-update.md §4.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Serial
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

